src/test/testtool/ZoekMetGeslachtsnaamEnGeboortedatum/01/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:a="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<BG:organisatie>NEDGR</BG:organisatie>
			<BG:applicatie>NEDMAG_VnA</BG:applicatie>
		</StUF:zender>
		<StUF:ontvanger>
			<BG:organisatie>0518</BG:organisatie>
			<BG:applicatie>DEC_ZKN</BG:applicatie>
			<BG:gebruiker>SH2102</BG:gebruiker>
		</StUF:ontvanger>
		<StUF:tijdstipBericht>20241015062256607</StUF:tijdstipBericht>
		<StUF:crossRefnummer>60c50a8f-d08c-483c-be67-2ab1a6bb9224</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
		<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS">
			<BG:inp.bsn>999992703</BG:inp.bsn>
			<BG:inp.a-nummer xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:geslachtsnaam>Rafi</BG:geslachtsnaam>
			<BG:voorvoegselGeslachtsnaam>El</BG:voorvoegselGeslachtsnaam>
			<BG:voorletters>M.</BG:voorletters>
			<BG:voornamen>Mohamed</BG:voornamen>
			<BG:aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
			<BG:geboortedatum>19490228</BG:geboortedatum>
			<BG:inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:verblijfsadres>
				<BG:aoa.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:wpl.woonplaatsNaam>'S-GRAVENHAGE</BG:wpl.woonplaatsNaam>
				<BG:aoa.woonplaatsWaarinGelegen>
					<BG:wpl.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
					<BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				</BG:aoa.woonplaatsWaarinGelegen>
				<BG:gor.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:opr.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:gor.openbareRuimteNaam>Ivoorhorst</BG:gor.openbareRuimteNaam>
				<BG:gor.straatnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:aoa.postcode>2592 TH</BG:aoa.postcode>
				<BG:aoa.huisnummer>155</BG:aoa.huisnummer>
				<BG:aoa.huisletter>Ivoorhorst 155</BG:aoa.huisletter>
				<BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:inp.locatiebeschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:begindatumVerblijf xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			</BG:verblijfsadres>
			<BG:sub.correspondentieAdres/>
			<BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.burgerlijkeStaat>1</BG:inp.burgerlijkeStaat>
			<BG:inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.datumInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.immigratieLand xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>